1.	Create a series using a list (my_list) and an array (my_arr). Both can be of length 10

In [1]:
import pandas as pd
import numpy as np

In [21]:
my_list = list(range(10,100,10))
my_arr = np.array(list(range(200,300,10)))
s1 = pd.Series(my_list)
s2 = pd.Series(my_arr)
print(s1)
print(s2)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64
0    200
1    210
2    220
3    230
4    240
5    250
6    260
7    270
8    280
9    290
dtype: int32

2.	Create a series using a dictionary from above my_list and my_arr as key and value pairs (Hint: my_dict = dict(zip(my_list, my_arr))

In [22]:
s3 = pd.Series(dict(zip(my_list,my_arr)))
s3

10    200
20    210
30    220
40    230
50    240
60    250
70    260
80    270
90    280
dtype: int64

3.	Create 3 series of different data types and concatenate them across axis = 1

In [29]:
s4 = pd.Series([20,'kiran',25000.00])
s5 = s4.replace([20,'kiran',25000.00],[30,'srinivas',35000.00])
s6 = s4.replace([20,'kiran',25000.00],[40,'lakshmi',45000.00])

In [30]:
pd.concat([s4,s5,s6],axis=1)

       0         1        2
0     20        30       40
1  kiran  srinivas  lakshmi
2  25000     35000    45000

4.	Create a data frame using a list of list and dictionary using a forced index

In [42]:
df1 = pd.DataFrame([[20,'kiran',25000.00],[30,'srinivas',35000.00],[40,'lakshmi',45000.00]],columns= ['Age','Name','sal'],index=[100,101,102])
df1

     Age      Name      sal
100   20     kiran  25000.0
101   30  srinivas  35000.0
102   40   lakshmi  45000.0

In [55]:
df1 = pd.DataFrame([[20,'kiran',25000.00],[30,'srinivas',35000.00],[40,'lakshmi',45000.00]],columns= ['Age','Name','sal'],index=[100,101,102])
df2 = pd.DataFrame({'Age':[20,30,40],'Name' : ['kiran','srinivas','lakshmi'],'sal' :[25000.00,35000.00,45000.00]})

In [69]:
df1 =df1.iloc[:,2:]

In [70]:
df1

   Age      Name      sal
0   20     kiran  25000.0
1   30  srinivas  35000.0
2   40   lakshmi  45000.0

In [71]:
df2

   Age      Name      sal
0   20     kiran  25000.0
1   30  srinivas  35000.0
2   40   lakshmi  45000.0

In [73]:
df1.equals(df2)

True

5.	Create a data frame with 2 integer columns and perform at least 3 numerical operation and storing them as adjacent columns. Your final df should contain 5 columns

In [78]:
df6 = pd.DataFrame([[100,200],[400,500]],columns=['col1','col2'])
df6

   col1  col2
0   100   200
1   400   500

In [81]:
df6['plus'] = df6['col1'] + df6['col2']
df6['minus'] = df6['col1'] - df6['col2']
df6['multi'] = df6['col1']/100
df6

   col1  col2  plus  minus  multi
0   100   200   300   -100    1.0
1   400   500   900   -100    4.0

6.	Delete 2 columns using del and drop function

In [82]:
del df6['plus']
df6

   col1  col2  minus  multi
0   100   200   -100    1.0
1   400   500   -100    4.0

In [92]:
df6 = df6.drop('minus',axis=1)
df6

   col1  col2  multi
0   100   200    1.0
1   400   500    4.0

7.	Create a data frame with shape 10x5 and extract only those records that are beyond row# 5

In [193]:
s5 = pd.Series(np.arange(0,50,1)).values.reshape(10,5)
df5 = pd.DataFrame(s5)
df5 = df5.loc[5:]
df5

    0   1   2   3   4
5  25  26  27  28  29
6  30  31  32  33  34
7  35  36  37  38  39
8  40  41  42  43  44
9  45  46  47  48  49

8.	Add a last row in a data frame and reset their index

In [115]:
df5

   0   1   2   3   4   10
5  25  26  27  28  29   1
6  30  31  32  33  34   2
7  35  36  37  38  39   3
8  40  41  42  43  44   4
9  45  46  47  48  49   5

In [118]:
df5 = df5.iloc[:,0:5]

In [130]:
df5 = df5.append({0:0,1:1,2:2,3:3,4:4},ignore_index = True).reset_index().iloc[:,1:]
df5

    0   1   2   3   4
0  25  26  27  28  29
1  30  31  32  33  34
2  35  36  37  38  39
3  40  41  42  43  44
4  45  46  47  48  49
5   0   1   2   3   4
6   0   1   2   3   4

9.	Slice all the rows but last 3 columns

In [132]:
df5.iloc[:,-3:]

    2   3   4
0  27  28  29
1  32  33  34
2  37  38  39
3  42  43  44
4  47  48  49
5   2   3   4
6   2   3   4

10.	Take first and last 5 observations using pre defined pandas function

In [134]:
df5.head()

    0   1   2   3   4
0  25  26  27  28  29
1  30  31  32  33  34
2  35  36  37  38  39
3  40  41  42  43  44
4  45  46  47  48  49

In [135]:
df5.tail()

    0   1   2   3   4
2  35  36  37  38  39
3  40  41  42  43  44
4  45  46  47  48  49
5   0   1   2   3   4
6   0   1   2   3   4

11.	Using any of the existing data frame, implement dtypes, shape and size functions

In [137]:
df5.dtypes

0    int64
1    int64
2    int64
3    int64
4    int64
dtype: object

In [138]:
df5.shape

(7, 5)

In [147]:
df5.describe()

               0          1          2          3          4
count   7.000000   7.000000   7.000000   7.000000   7.000000
mean   25.000000  26.000000  27.000000  28.000000  29.000000
std    18.257419  18.257419  18.257419  18.257419  18.257419
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%    12.500000  13.500000  14.500000  15.500000  16.500000
50%    30.000000  31.000000  32.000000  33.000000  34.000000
75%    37.500000  38.500000  39.500000  40.500000  41.500000
max    45.000000  46.000000  47.000000  48.000000  49.000000

In [141]:
df5.size

35

12.	Calculate the sum of the values across axis=1 for a data frame. Here, string columns will be not considered by default while performing calculations

In [152]:
df5.sum()

0    175
1    182
2    189
3    196
4    203
dtype: int64

12.	Calculate the sum of the values across axis=1 for a data frame. Here, string columns will be not considered by default while performing calculationsm

In [153]:
df5.std()

0    18.257419
1    18.257419
2    18.257419
3    18.257419
4    18.257419
dtype: float64

In [151]:
df5

    0   1   2   3   4
0  25  26  27  28  29
1  30  31  32  33  34
2  35  36  37  38  39
3  40  41  42  43  44
4  45  46  47  48  49
5   0   1   2   3   4
6   0   1   2   3   4

14.	Take min and max of a column, also describe the basic statistics of a data frame

In [155]:
df5.min()

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [157]:
df5.max()

0    45
1    46
2    47
3    48
4    49
dtype: int64

In [197]:
df5 = df5.rename(columns = {0:'zer',1:'one',2:'two',3:'thr',4:'fou'})

In [166]:
df5

   zer  one  two  thr  fou
0   25   26   27   28   29
1   30   31   32   33   34
2   35   36   37   38   39
3   40   41   42   43   44
4   45   46   47   48   49
5    0    1    2    3    4
6    0    1    2    3    4

16.	Apply sort to the first column and reset the index`

In [199]:
df5
df6 = df5.copy()
df5 = df5.sort_values('fou').reset_index()

In [201]:
df5 = df5.sort_values('fou',ascending=False).reset_index()
df5

   level_0  index  zer  one  two  thr  fou
0        4      9   45   46   47   48   49
1        3      8   40   41   42   43   44
2        2      7   35   36   37   38   39
3        1      6   30   31   32   33   34
4        0      5   25   26   27   28   29

17.	Using iloc, take the first 4 observations and last 2 columns

In [202]:
df5.iloc[0:4,-2:]

   thr  fou
0   48   49
1   43   44
2   38   39
3   33   34

In [ ]:
18.	Create a data frame with multiple Nan records and fill them with a generic number

In [210]:
df5.loc[2:3,'one':'thr'] = np.NAN
df5.fillna(10,inplace=True)

In [211]:
df5

   level_0  index  zer   one   two   thr  fou
0        4      9   45  46.0  47.0  48.0   49
1        3      8   40  41.0  42.0  43.0   44
2        2      7   35  10.0  10.0  10.0   39
3        1      6   30  10.0  10.0  10.0   34
4        0      5   25  26.0  27.0  28.0   29

18.	Create a data frame with multiple Nan records and fill them with a generic number

In [218]:
df5.loc[2:3,'one':'thr'] = np.NAN
df5.isna().sum()

level_0    0
index      0
zer        0
one        2
two        2
thr        2
fou        0
dtype: int64

20.	Please implement the group by and merge function with multiple conditions and get accustomed to itb

In [223]:
df1

   Age      Name      sal
0   20     kiran  25000.0
1   30  srinivas  35000.0
2   40   lakshmi  45000.0

In [222]:
df1.groupby(['Age'])['sal'].sum()

Age
20    25000.0
30    35000.0
40    45000.0
Name: sal, dtype: float64

In [227]:
df1.merge(df2,on='Age',how='inner')

   Age    Name_x    sal_x    Name_y    sal_y
0   20     kiran  25000.0     kiran  25000.0
1   30  srinivas  35000.0  srinivas  35000.0
2   40   lakshmi  45000.0   lakshmi  45000.0